* Tasks
#+REVEAL_THEME: night
#+REVEAL: split
#+REVEAL_MAX_SCALE: 0.95
** TODO java learning,you should take care the XML                              :javaxml:

Added: [2015-05-03 Sun 19:04]
** TODO finish a learning report about the java                                 :javaxml:
   - 
Added: [2015-05-03 Sun 19:17]
** DOING TestTodo                                                      :@Test:
- State "DOING"      from "TODO"         [2017-10-08 周日 03:19]
*** CANCELED [#A] little [100%]                                           :funnny:
CLOSED: [2017-10-08 周日 03:18]
- State "CANCELED"   from "DOING"         [2017-10-08 周日 03:18]
- State "DOING"      from "DONE"          [2017-10-08 周日 03:18]
- State "DONE"       from "TODO"         [2017-10-08 周日 03:18]
- State "TODO"       from "DONE"       [2017-09-27 周三 16:51]
- State "DONE"       from "TODO"       [2017-09-27 周三 16:51]
 - [X] first
 - [X] second
 - [X] last
 - :q

Added: [2015-05-03 Sun 21:38]
** DONE TODOS setting CFD calculation                                :@work:
CLOSED: [2017-09-29 周五 23:41] SCHEDULED: <2017-09-13 周三>
 
- State "DONE"       from              [2017-09-29 周五 23:41]
 Added: [2017-09-13 周三 01:22]
*dfdf* 
 /slash/
** TODOS read the elisp code                                         :@F708:

Jumping to code

(define-key emacs-lisp-mode-map (kbd "C-c .") 'find-function-at-point)
(bind-key "C-c f" 'find-function)


Added: [2017-09-27 周三 17:50]
** TODO find the army software
:PROPERTIES:
:Effort: 0:15
:END:
Captured 2017-09-27 22:52
** TODO GetThingsDone
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-09-28 11:21
*** 1. you capture the ideas or todos(capture--refile--consider,organize---review---do)
*** 2. you capture your todos with time, so you have time pocket(momentum); However
*** 2.5 however, you will be overwhelmed by tasks, so you can also group tasks into projects or context.(group tasks into project)
*** 3. List your todos or tasks with routines and checklists, so you can do things consistently even if fuzzy brains
*** 4. you need to schedule the most important thing to be done , so you don't take off the ball and focus a little things(You dont'
worry about missing deadline.(scheduled tasks will be informed of you)
*** 5. but still too much. So be realistics and add priviledge to your schedule tasks, eliminate some not so important not so hurry
*** 6. finally you track all you task (so you know what the time went by)
*** 7. also you do some overview the process (so you do appreciate how things adds up)
** DONE [#A] new mesh for the double-sliding mesh :@work::multiAxis:紧急重要:
CLOSED: [2017-09-29 周五 23:40] SCHEDULED: <2017-09-28 周四>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"       [2017-09-29 周五 23:40]
                    Captured 2017-09-28 13:52
** TODO [#B] Read papers related to yaw preparing for the thesis proposal :@work::graduation:紧急重要:
SCHEDULED: <2017-09-29 周五 . +1w>

- State "TODO"       from "TODO"          [2017-10-08 周日 02:33]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-09-28 13:58
** DONE [#B] change the list style in org-mode                    :PERSONAL:
CLOSED: [2017-09-29 周五 09:45] DEADLINE: <2017-09-28 周四>
                    :PROPERTIES:
                    :Effort: 0:15
                    :END:
                    - State "DONE"       from "TODO"       [2017-09-29 周五 09:45]
                    Captured 2017-09-28 14:07
                Doesn't work!                   
** DONE [#B] First Report for your graduation                           :@work:
CLOSED: [2017-10-26 周四 10:30] DEADLINE: <2017-10-23 周一> SCHEDULED: <2017-10-02 周一>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:30]
                    Captured 2017-10-02 11:05
** DONE [#A] 开题报告+文献综述+中央高校基金                             :@work:
CLOSED: [2017-10-26 周四 10:29] DEADLINE: <2017-10-22 周日> SCHEDULED: <2017-10-03 周二>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:29]
                    :LOGBOOK:
                    CLOCK: [2017-10-14 周六 23:42]--[2017-10-15 周日 00:29] =>  0:47
                    CLOCK: [2017-10-14 周六 23:30]--[2017-10-14 周六 23:36] =>  0:06
                    :END:
                    Captured 2017-10-03 14:15
       开题报告得包含以下几个部分，
***** TODO 数值模拟 静态偏航+动态偏航+ 流固耦合(参考仇永兴 姚世刚 陈晓明 范钟瑶 李媛 任会来) [0%]
- State "TODO"       from "TODO"       [2017-10-03 周二 14:25]
- State "TODO"       from "ABORT"      [2017-10-03 周二 14:25] [ ] 
- [-] 任务分解 [20%]
  1. [ ] 背景介绍
     1. [ ]《风电13五规划》
     2. [ ]《2006-2016风电装机容量发展》
     3. [ ]《2016年度全球风电报告》 4%占全球总发电量
     4. [ ] 气弹非稳定性
  2. [X] 静态偏航
  3. [-] 动态偏航
     1. [X] 动态入流角
        在cfx的结果，暂时以失败告终。
     2. [ ] 机舱偏航
  4. [-] 流固耦合(参考姚世刚 李媛 李新凯 陈晓明)
     1. [X] 单向
     2. [ ] 双向
  5. [ ] FVM 自由涡尾迹(参考仇永兴)
#+REVEAL: split
***** TODO 实验部分 NREL5MW的数值模拟(参考赵宗德 周广鑫 李新凯) [0%]
- State "TODO"       from              [2017-10-03 周二 14:25]
- [ ] 任务分解
  - [ ] NREL5MW的实验研究
    - [ ] 叶片介绍
    - [ ] 轮毂+塔架介绍
    - [ ] 控制系统介绍
    - [ ] 实验方案介绍
      - [ ] 偏航实验
      - [ ] 前后四周晃动实验
  - [ ] 丝线实验 流场可视化实验
** DONE [#B] 办理工程热物理注册问题   [100%]                           :@work:
CLOSED: [2017-10-11 周三 17:48] DEADLINE: <2017-10-11 周三> SCHEDULED: <2017-10-08 周日>


- State "DONE"       from "TODO"         [2017-10-11 周三 17:48]
- State "TODO"       from "TODO"         [2017-10-11 周三 17:48]
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "TODO"       from "DOING"          [2017-10-09 周一 15:52]
                    - State "DOING"      from "TODO"          [2017-10-09 周一 02:25]
                    Captured 2017-10-08 22:29

1. [X] 询问财务处，9号办理汇款是否可以在10号前拿到汇款凭证
       当天上午办理 当天下午即可查询，并且可以拖上几天，只要跟裴老师说一声即可
2. [X] 询问是否需要统一汇款还是分开汇款(分开回执，估计是分开汇款）
       可以统一汇款，备注相关信息即可
汇款账号

#+BEGIN_EXAMPLE
户名：江苏大学镇江流体工程装备技术研究院
银行：农业银行镇江江大支行（行号：1033 1403 1235）
账号：1031 2301 0400 0615 2
纳税人识别号：3211 0046 8697 050 
银行地址：镇江新区丁卯经十五路99号国家大学科技园D43楼

#+END_EXAMPLE

电话联系人：
联系人：裴吉，手机：13776474939

1. [X] 务必在回执邮件落款著名联系人姓名、手机和邮箱
2. [X] 回执邮件中请务必将转账/汇款凭证扫描件附在邮件中一起发送
3. [X] 务必在汇款备注中注明“参会编号（GJ-XX）-发票抬头-第一位作者姓名”，例如“GJ-015-清华大学-李四”
4. [X] 确认康老师的住房预定问题
5. [X] 10月11号 周三办理 汇款程序
** PENDING [#B] Doing sports(must be)                            :@Dormitry:
SCHEDULED: <2017-10-10 周二 +1d>
                    :PROPERTIES:
                    :Effort: 1:00
                    :LAST_REPEAT: [2017-10-09 周一 20:55]
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-09 周一 20:55]
                    Captured 2017-10-09 15:53
 坚持每一天都做运动
** DONE [#C] 提醒王老师旋转对风轮转捩的影响
CLOSED: [2017-10-18 周三 13:29] DEADLINE: <2017-10-16 周一> SCHEDULED:<2017-10-12 周四>
- State "DONE"       from "TODO"          [2017-10-18 周三 13:29]
** DONE [#B] 通知赵老板安装推力软件                                     :@work:
CLOSED: [2017-10-26 周四 10:30] DEADLINE: <2017-10-21 周六>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:30]
                    Captured 2017-10-13 21:20
** TODO [#B] turbsim reading   [2017-10-15 周日 00:58-02:08]
                                                         :@work:
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-15 周日 01:24]--[2017-10-15 周日 01:25] =>  0:01
                    CLOCK: [2017-10-15 周日 00:31]--[2017-10-15 周日 01:18] =>  0:47
                    CLOCK: [2017-10-15 周日 00:30]--[2017-10-15 周日 00:30] =>  0:00
                    :END:
                    Captured 2017-10-15 00:29
                    
刘文为主
** TODO [#B] 干好一件事 <2017-10-16 周一 23:48>                      :@work:
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-16 周一 23:48]--[2017-10-16 周一 23:49] =>  0:01
                    :END:
                    
                    
全年一件事，干好一件事即可！
男人能干好一件事即可
** DONE [#B] 确认长峪城下雨情况 <2017-10-18 周三 14:39>                :@NCEPU:
CLOSED: [2017-10-21 周六 00:51] DEADLINE: <2017-10-19 周四>
                    :PROPERTIES:
                    :Effort: 0:05
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-21 周六 00:51]
                    :LOGBOOK:
                    CLOCK: [2017-10-18 周三 14:39]--[2017-10-18 周三 14:40] =>  0:01
                    :END:
** TODO [#B] 中科院赵明多轴角运动 <2017-10-18 周三 20:48>            :@work:
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-18 周三 20:49]--[2017-10-18 周三 20:49] =>  0:00
                    :END:
                    
                    
探讨fluent的udf多轴角编写问题
** DONE [#B] 完成入党申请资料 <2017-10-19 周四 19:52>                   :@F708:
CLOSED: [2017-10-26 周四 11:07]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "DONE"       from "TODO"          [2017-10-26 周四 11:07]
                    :LOGBOOK:
                    CLOCK: [2017-10-19 周四 19:53]--[2017-10-19 周四 19:53] =>  0:00
                    :END:
                    
                    
入党申请
** TODO [#B] [25%]学习sketchup和几何画板 <2017-10-19 周四 20:02>        :@work:
SCHEDULED: <2017-10-26 周四>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-19 周四 20:02]--[2017-10-19 周四 20:02] =>  0:00
                    :END:
                    
                    
抓紧提个时间学习
1. [X] 直线、射线、线段绘制
2. [X] 三点圆弧绘制、圆上弧绘制
3. [X] 三点内部  4点内部  5点内部（CTrl+P)填充内部
4. [X] 直线 点构造圆，通过直线长度控制圆的半径
5. [X] 构造角平分线 垂线  平行线（有约束关系在里头，这句话数学老师不好讲，得有工科背景的学生能说）三角形三条角平分线的焦点构成内心
6. [X] 绘制点的运动轨迹(C-T)  构造---轨迹
7. [ ] 利用箭头工具组（包含平移 旋转  缩放三组）
8. [ ] 
9. [ ] 
10. [ ] 
11. [ ] 
12. [ ] 
13. [ ] 
14. [ ] 
15. [ ] 
16. [ ] 
17. [ ] 
18. [ ] 
19. [ ] 
20. [ ] 
21. [ ] 
22. [ ] 
23. [ ] 
24. [ ] 
** TODO [#B] Somethings need to be done by yourself <2017-10-21 周六 21:12> :@work:
DEADLINE: <2019-10-21 周一>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-21 周六 21:13]--[2017-10-21 周六 21:14] =>  0:01
                    :END:
                    
                    
Somethings you need to be done by yourself
** TODO [#B] SCI结果后处理 <2017-10-21 周六 21:58>                   :@work:
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-21 周六 21:58]--[2017-10-21 周六 22:48] =>  0:50
                    :END:
                    
                    
关于动态偏航和动态入流，分三个阶段写：定常  非定常（时均解） 动态入流
** TODO [#B] [91%]入党申请 <2017-10-24 周二 15:38>      :@F708:laptop:紧急重要:
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    - State "TODO"       from "DONE"          [2017-10-26 周四 19:10]
                    - State "DONE"       from "TODO"          [2017-10-26 周四 10:29]
                    :LOGBOOK:
                    CLOCK: [2017-10-24 周二 15:39]--[2017-10-24 周二 15:44] =>  0:05
                    :END:
                    
                    
1. [X] 入党申请书，手写1份
2. [X] 自传，手写1份
3. [X] 团组织推优为入党积极分子意见表1份
4. [X] 入党积极分子考察表（本）一份 （发通知统一发放） 日(在党支书)
5. [X] 入党积极分子培训班结业证明1份(在党支书)
6. [X] 发展对象培训班结业证明1份(本来应该有，现在没有) 博士不用管
7. [X] 思想汇报（4篇，时间为从确定为积极分子到现在，手写）
8. [X] 党内外座谈记录（党内一份、党外一份，人数要求全班三分之二以上）
9. [X] 发展对象政审表 
10. [X] 入党政审函调表
11. [X]  入党志愿书，1份，（发通知统一发放。） 
12. [ ] 补充入党积极分子培养考察表中每个季度的培养考察信息（8次)

博动1543党支部拟于近期讨论接收叶昭良为中共预备党员。现将有关情况公示如下：
叶昭良，男，	1990年1月7日出生，籍贯，硕士学历，，
2001年9月至2004年6月就读于平和县大溪中学，
2004年9月至2007年6月就读于平和县平和一中，
2007年9月至2008年6月复读于泉州一中，
2008年9月至2012年6月于华北电力大学攻读本科学位，
2012年9月至2015年3月于华北电力大学攻读硕士学位，
2015年9月至今于华北电力大学攻读博士学位，现任团支部书记。

1. 2013年9月15日提出入党申请，
2. 2015年12月15日经党支部研究确定为入党积极分子
3. 2017年9月1日被列为发展对象。
4. 2017年10月19日经博动1543党支部开会讨论并投票，
同意发展为预备党员。政治审查合格。


我叫叶昭良，1990年1月7日出生于*市的一个农村家庭，2003年加入共青团组织，
并于2013年出递交了入党申请书，2015年12月确认为入党积极分子，
并积极参加党校的培训，2017年9月列为发展对象
，2017年通过大家的同意列为预备党员。现为华北电力大学博动1543班的团支书
** TODO [#B] strggle(1.02^365=1377.4) <2017-10-26 周四 19:51>           :@work:
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-26 周四 19:51]--[2017-10-26 周四 19:55] =>  0:04
                    :END:
                    
                    
1.01^365 =37.8 
0.99^365 =0.03
如果等式1告诉我们，积硅以致千里，积懒惰以致深渊
1.02^365 = 1377.4
0.98^365 = 0.0006
那么等式2告诉我们，只比你努力一点的人，其实已经甩你很远
** TODO [#B] [50%]查新报告 <2017-10-27 周五 12:48>                      :@work:
DEADLINE: <2017-11-11 周六>

                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    :LOGBOOK:
                    CLOCK: [2017-10-27 周五 12:48]--[2017-10-27 周五 12:53] =>  0:05
                    :END:
                    
              
1. [ ] 资格考试审核表(617)
2. [X] 开题报告
3. [X] 文献综述
4. [ ] 查新报告
请开题通过的同学在11月10日前完成开题材料的递交工作，包括《文献综述与开题报告评审表》+开题报告+文献综述+查新报告，全部材料先交给我。
说明：1.班级内参加24日资格考试的博士生包括在职博士的资格审核表全部在我这里，提交材料时，再将自己的审核表附上即可。
2. 在《文献综述与开题报告评审表》背面需要老师签字的地方，由于在资格考试中像杜老师、徐老师没有参加，在签字过程中仍找这些大老师签字，而不是去找资格考试中代理老师签字。
3. 开题报告和文献综述在打印时封面不要出现“资格考试用”等字眼，且开题报告打印时，由原来的“预开题报告”改作“开题报告”。
4.材料每一项单独装订，之后用曲别针夹上全部材料。
5. 能环专业上交材料的要求一样，按照“资格考试审核表+评审表+开题报告+文献综述+查新报告”顺序排好，准备好后自行提交。
6.仍需单独开题的同学，联系导师开题之后，自己交材料即可。
7.其他年级资格审查表，不在我这里，需要由同组实验室同学通知去F617领取。*  Tasks

** TODO Most important thing that you have to do          :graduation:紧急重要:

** TODO Second most important thing that you have to do
You can also take notes underneath each heading, like this
** 花销(expense)

That's your gtd

| Date              | Category |  Money | People | Note |
|-------------------+----------+--------+--------+------|
| <2017-10-07 周六> | Book     |   30.6 |        |      |
| <2017-10-09 周一> | Film     |   70.6 |        |      |
| <2017-11-10 周五> | Bus      |   50.2 |        |      |
| <2017-11-11 周六> | Bus      |   60.2 | xinran |      |
| <2017-11-12 周日> | Eating   |   1000 | Ye     |      |
|-------------------+----------+--------+--------+------|
|                   | Total:   | 1211.6 |        |      |
#+TBLFM: @>$3=vsum(@2..@-1)   

#+REVEAL: split
#+BEGIN_EXAMPLE
@> The @ specifies a row, and this refers to the last row in a table.
    $3 The $ specifies a column, so this refers to the third column.
    vsum A vertical sum function with parameters given in parenthesis
    @2 The second row. Notice that it the Amount header is @1 and the dashes separating the header from the body is ignored.
    @-1 The next to the last row. Using these relative references mean that we can add rows to our table, and still have the sum formula work.


http://www.howardism.org/Technical/Emacs/spreadsheet.html
#+END_EXAMPLE



